app/controllers/api/v1/conversations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "EJYnuwkfVK67uYZHkfMDkSNK"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."receiver_id" = $1  [["receiver_id", 14]]
---
  def get_all_conversations
    @user = User.find_by_token(params['token'])
    if @user
      @conversations = Conversation.where("user_id = ? OR receiver_id = ?", @user.id, @user.id)

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @conversation = Conversation.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "EJYnuwkfVK67uYZHkfMDkSNK"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "erikpogi@sourcepad.com"], ["LIMIT", 1]]
INSERT INTO "conversations" ("user_id", "receiver_id", "subject", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 14], ["receiver_id", 15], ["subject", "test subject"], ["status", "unread"], ["created_at", 2017-02-20 06:30:13 UTC], ["updated_at", 2017-02-20 06:30:13 UTC]]
INSERT INTO "messages" ("conversation_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["conversation_id", 10], ["user_id", 15], ["content", "hahaha"], ["created_at", 2017-02-21 08:07:03 UTC], ["updated_at", 2017-02-21 08:07:03 UTC]]
---
  def create
    context = {
      success: false
    }
    user = User.find_by_token(params[:token])
    receiver = User.find_by_email(params[:email])
    status = params[:status]
    subject = params[:subject]
    content = params[:content]

    @conversation = Conversation.new({user_id: user.id, receiver_id: receiver.id, status: status, subject: subject})

    if @conversation.save
      @message = @conversation.messages.create({content: params[:content], user_id: user.id})

SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "kd1v6rj26y4gekaWsvyBjCsD"], ["LIMIT", 1]]
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "messages" ("conversation_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["conversation_id", 10], ["user_id", 15], ["content", "oh shit"], ["created_at", 2017-02-21 08:21:21 UTC], ["updated_at", 2017-02-21 08:21:21 UTC]]
---
  def send_message
    context = { success: false }
    token = params[:token]
    conversation_id = params[:conversation_id]
    content = params[:content]
    user = User.find_by_token(token)
    @conversation = Conversation.find(params[:conversation_id])
    @message = @conversation.messages.create({content: params[:content], user_id: user.id})