app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    context = { success: false }

    @user = User.new({
      email: params['email'],
      password: params['password'],
      password_confirmation: params['password_confirmation']})

    if @user.save

SELECT  "users".* FROM "users" WHERE (email = 'erikpogi@sourcepad.com', password = 'erikpogi') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def login
    context = { success: false }

    email = params['email']
    password = params['password']

    @user = User.find_by email: email